<template>
  <div>
    <div class="terms">
      <h3 style="text-align: center">눈송백서 가입약관</h3>
      <b-card class="text-left">
        <b-card-text>
          1. 눈송백서는 대한민국의 법령 기타 규정을 준수합니다.
        </b-card-text>
        <b-card-text>
          2. 눈송백서에서 타인의 개인정보를 사칭 또는 도용하거나, 눈송백서의 계정을 타인에게 양도, 판매하거나, 타인의 권리, 이익 등을 해치는 등 기타 법령에 위반되는 행위를 했을 경우 가입을 취소하고 영구적으로 가입을 막을 수 있습니다.
        </b-card-text>
        <b-card-text>
          3. 눈송백서는 회원정보에 대해 1차적으로 데이터베이스에 저장하는 것 외에 별도 백업을 하지 않으며 데이터베이스에 저장되는 회원정보는 가입시부터 탈퇴시까지만 보관됩니다.
        </b-card-text>
        <b-card-text>
          4. 눈송백서는 회원이 작성한 게시물과 댓글에 대해 1차적으로 데이터베이스에 저장하는 것 외에 별도 백업을 하지 않으며 데이터베이스에 저장되는 게시글과 댓글은 회원이 작성한 시점부터 삭제하는 시점까지 보관됩니다.
        </b-card-text>
        <b-card-text>
          5. 이미 탈퇴한 회원이 작성한 게시글 또는 댓글 삭제를 요청할 경우 눈송백서는 그 요청이 법령 기타 규정을 위반한 증거의 인멸 등의 목적이 아닌 한 지체없이 요청사항을 이행하도록 노력합니다.
        </b-card-text>
        <b-card-text>
          6. 회원은 아이디, 비밀번호를 포함하여 눈송백서에 입력한 자신의 개인정보에 대한 관리 책임이 있으며, 회원 본인의 고의 또는 과실로 인한 아이디, 비밀번호를 포함한 개인정보의 누출로 눈송백서에서 불이익을 받았을 경우 모든 책임은 회원 본인에게 있습니다.
        </b-card-text>
        <b-card-text>
          7. 눈송백서의 회원은 트위터, 페이스북 등 일반적인 사회관계망서비스(SNS)에 보편적으로 적용되는 커뮤니티 가이드라인을 준수해야 하며, 특정한 개인 또는 집단에 대한 비방, 차별, 폭력, 혐오발언 등을 해서는 안됩니다. 눈송백서는 회원이 커뮤니티 규칙을 위반할 경우 게시글/댓글 삭제 및 회원 활동에 제재를 가할 수 있습니다.
        </b-card-text>
        <b-card-text>
          8. 회원이 작성한 모든 게시물의 내용에 대한 권리와 책임은 회원 본인에게 귀속되며, 눈송백서는 게시판 운영원칙에 따라 그러한 게시물 또는 댓글을 사전 통지 없이 편집, 이동할 수 있는 권리를 가집니다.
        </b-card-text>
        <b-card-text>
          9. 눈송백서는 회원이 입력 또는 게시한 개인정보를 타인에게 절대 누설하거나 배포하지 않습니다. 단, 법령 기타 규정에 의할 경우는 다를 수 있습니다.
        </b-card-text>
        <b-card-text>
          10. 본 약관에 명시 되지 않거나 법령 기타 규정과 다른 부분이 있을 경우 법령 기타 규정에 따릅니다.
        </b-card-text>
        <b-card-text>
          11. 회원에 가입하려는 자는 본 가입 약관에 비동의할 수 있으나, 동의를 거부할 시 회원으로 가입할 수 없습니다.
        </b-card-text>
      </b-card>
    </div>
    <div class="policy">
      <h3 style="text-align: center">개인정보 수집 및 이용 동의</h3>
      <b-card class="text-left">
        <b-card-text>
          1. 개인정보 수집 및 이용 목적: 회원 관리, 본인 확인, 컨텐츠 제공, 특정 맞춤 서비스 제공(마이페이지, 게시판 등)
        </b-card-text>
        <b-card-text>
          2. 수집하는 개인정보(필수정보): 아이디, 비밀번호, 이름, 이메일, 학과, 입학연도, 전공, 학생증
        </b-card-text>
        <b-card-text>
          3. 개인정보 보유 및 이용기간: 학생증은 개인정보 확인 후 지체없이 파기하며, 기타 회원정보는 탈퇴시 지체없이 파기합니다.
        </b-card-text>
        <b-card-text>
          4. 정보주체는 본 개인정보 수집 및 이용 동의를 거부할 권리가 있으나, 거부할 경우 회원으로 가입할 수 없습니다.
        </b-card-text>
      </b-card>
    </div>
  </div>
</template>
<style>
.terms, .policy {
  width: 90%;
  margin: 3rem auto;
}
</style>
